Tekla Open API Reference for Tekla Structures 2025
NumericConstantFilterExpression Constructor
Overload List
Name | Description
NumericConstantFilterExpression(IEnumerable<Double>)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(IEnumerable<Int16>)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(IEnumerable<Int32>)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(IEnumerable<Int64>)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(IEnumerable<UInt16>)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(IEnumerable<UInt32>)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(IEnumerable<UInt64>)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(Double)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(Int16)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(Int32)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(Int64)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(UInt16)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(UInt32)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(UInt64)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(IEnumerable<TeklaStructuresDatabaseTypeEnum>)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(TeklaStructuresDatabaseTypeEnum)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(IEnumerable<Double>, IFormatProvider)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(IEnumerable<Int16>, IFormatProvider)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(IEnumerable<Int32>, IFormatProvider)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(IEnumerable<Int64>, IFormatProvider)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(IEnumerable<UInt16>, IFormatProvider)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(IEnumerable<UInt32>, IFormatProvider)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(IEnumerable<UInt64>, IFormatProvider)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(Double, IFormatProvider)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(Int16, IFormatProvider)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(Int32, IFormatProvider)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(Int64, IFormatProvider)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(UInt16, IFormatProvider)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(UInt32, IFormatProvider)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(UInt64, IFormatProvider)
 Initializes a new instance of the NumericConstantFilterExpression class.
Top
See Also
Reference
NumericConstantFilterExpression Class
Tekla.Structures.Filtering Namespace